## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `github_actions_secret.terraform_github_manifests_workflow_token[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:42:02.029 STDOUT terraform:   + create
14:42:02.029 STDOUT terraform: Terraform will perform the following actions:
14:42:02.029 STDOUT terraform:   # github_actions_secret.terraform_github_manifests_workflow_token[0] will be created
14:42:02.029 STDOUT terraform:   + resource "github_actions_secret" "terraform_github_manifests_workflow_token" {
14:42:02.029 STDOUT terraform:       + created_at      = (known after apply)
14:42:02.029 STDOUT terraform:       + id              = (known after apply)
14:42:02.029 STDOUT terraform:       + plaintext_value = (sensitive value)
14:42:02.029 STDOUT terraform:       + repository      = "notification-terraform"
14:42:02.029 STDOUT terraform:       + secret_name     = "MANIFESTS_WORKFLOW_TOKEN"
14:42:02.029 STDOUT terraform:       + updated_at      = (known after apply)
14:42:02.029 STDOUT terraform:     }
14:42:02.029 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
14:42:02.029 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
14:42:02.029 STDOUT terraform: Saved the plan to: plan.tfplan
14:42:02.029 STDOUT terraform: To perform exactly these actions, run the following command to apply:
14:42:02.029 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
